Q1回答
mysql> SHOW DATABASES;
+--------------------+
| Database           |
+--------------------+
| db_lesson          |
| information_schema |
| mysql              |
| performance_schema |
| sys                |
+--------------------+
5 rows in set (0.01 sec)

mysql> USE db_lesson;
Reading table information for completion of table and column names
You can turn off this feature to get a quicker startup with -A

Database changed
mysql>  SHOW TABLES;
+---------------------+
| Tables_in_db_lesson |
+---------------------+
| people              |
| reports             |
+---------------------+1 rows in set (0.00 sec)

mysql> CREATE TABLE departments (
       department_id INT unsigned AUTO_INCREMENT NOT NULL PRIMARY KEY,
       name VARCHAR(20) NOT NULL,
       created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
       updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
       );
Query OK, 0 rows affected (0.01 sec)

mysql> DESC departments;
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type         | Null | Key | Default           | Extra                                         |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| department_id | int unsigned | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)  | NO   |     | NULL              |                                               |
| created_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
4 rows in set (0.00 sec)



Q2回答e
mysql>  SHOW DATABASES;
+--------------------+
| Database           |
+--------------------+
| db_lesson          |
| information_schema |
| mysql              |
| performance_schema |
| sys                |
+--------------------+
5 rows in set (0.00 sec)

mysql> USE db_lesson;
Reading table information for completion of table and column names
You can turn off this feature to get a quicker startup with -A

Database changed
mysql> SHOW TABLES;
+---------------------+
| Tables_in_db_lesson |
+---------------------+
| departments         |
| people              |
| reports             |
+---------------------+
3 rows in set (0.01 sec)

mysql> use people
ERROR 1049 (42000): Unknown database 'people'
mysql> DESC people;
+------------+------------------+------+-----+-------------------+-----------------------------------------------+
| Field      | Type             | Null | Key | Default           | Extra                                         |
+------------+------------------+------+-----+-------------------+-----------------------------------------------+
| person_id  | int unsigned     | NO   | PRI | NULL              | auto_increment                                |
| name       | varchar(20)      | NO   |     | NULL              |                                               |
| email      | varchar(255)     | YES  | UNI | NULL              |                                               |
| age        | tinyint unsigned | YES  |     | NULL              |                                               |
| gender     | tinyint          | YES  |     | NULL              |                                               |
| created_at | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+------------+------------------+------+-----+-------------------+-----------------------------------------------+
7 rows in set (0.00 sec)

mysql> ALTER TABLE people ADD COLUMN department_id INT unsigned;
Query OK, 0 rows affected (0.02 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> DESC people;
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type             | Null | Key | Default           | Extra                                         |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| person_id     | int unsigned     | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)      | NO   |     | NULL              |                                               |
| email         | varchar(255)     | YES  | UNI | NULL              |                                               |
| age           | tinyint unsigned | YES  |     | NULL              |                                               |
| gender        | tinyint          | YES  |     | NULL              |                                               |
| created_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
| department_id | int unsigned     | YES  |     | NULL              |                                               |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
8 rows in set (0.00 sec)

mysql> ALTER TABLE people MODIFY department_id int unsigned AFTER email;
Query OK, 0 rows affected (0.02 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> DESC people;
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type             | Null | Key | Default           | Extra                                         |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| person_id     | int unsigned     | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)      | NO   |     | NULL              |                                               |
| email         | varchar(255)     | YES  | UNI | NULL              |                                               |
| department_id | int unsigned     | YES  |     | NULL              |                                               |
| age           | tinyint unsigned | YES  |     | NULL              |                                               |
| gender        | tinyint          | YES  |     | NULL              |                                               |
| created_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
8 rows in set (0.00 sec)

Q3回答
mysql> INSERT INTO departments (name)
   VALUES
    ("営業"),
    ("開発"),
    ("経理"),
    ("人事"),
    ("情報システム");
Query OK, 5 rows affected (0.01 sec)
Records: 5  Duplicates: 0  Warnings: 0

INSERT INTO people (name, email, department_id, age, gender)
VALUES
   ('歌仙兼定', 'kasen@gizumo.jp','1', 31,1),
   ('和泉守兼定', 'izuminokami@gizumo.jp','2', 29,1),
   ('燭台切光忠', 'shokudaigiri@gizumo.jp', '1', 31, 1),
   ('へし切長谷部', 'hesikiri@gizumo.co.jp','2', 28,1),
   ('山姥切長義','chogi@gizumo.co.jp','4',26,1),
   ('一文字則宗', NULL,'5',NULL,NULL),
   ('山姥切国広','kinihiro@gizumo.jp','1',26,1),
   ('松井江','matuigou@gizumo.jp','3',25,1),
   ('肥前忠弘','hizen@gizumo.co.jp','2',24,1),
   ('南海太郎朝尊','nannkai@gizumo.co.jp','2',35,1);

INSERT INTO  reports (person_id,content,created_at,updated_at)
     VALUES
     ('20','長谷部国重作の打刀。名の由来は、信長が膳棚の下に隠れた茶坊主をその棚ごと圧し切ったことから。
    ','2025/1/20','2025/1/21'),
     ('18','幕末から活躍した兼定の作であり、新撰組副長 土方歳三が愛用したと言われる大振りの刀
    ','2025/1/16','2025/1/21'),
     ('17','「之定」の異名を持つ、二代目兼定作の打刀。持ち主だった細川忠興が３６人の家臣を手討ちしたことから、三十六歌仙にちなんで歌仙兼定と呼ばれる。
    ','2024/12/28','2025/1/6'),
     ('23','霊剣『山姥切』を模して造られたとされる打刀。オリジナルでないことがコンプレックス。
    ','2025/1/12','2025/1/16'),
     ('19','備前長船派の事実上の祖といわれている刀工、光忠の作。名は、伊達政宗がこの太刀で家臣を斬った際にその勢いで燭台まで斬れたという話が由来。
    ','2025/1/16','2025/1/21'),
     ('25','岡田以蔵が使用していたとされる脇差。','2025/1/12','2025/1/18'),
     ('26','武市半平太が使用していたとされる打刀。学者然とした刀剣男士であり、知識で審神者を助ける。
    ','2025/1/10','2025/1/18'),                                            
     ('21','備前長船長義作の打刀。長義は長船派の主流とは別系統の刀工となる。写しであると言われている山姥切国広と共に伯仲の出来。
    ','2025/1/6','2025/1/21'),
     ('22' ,'福岡一文字派の作とされている太刀。則宗は福岡一文字派の始祖であり、後鳥羽院番鍛冶の一人として名高い。
    ','2025/1/21','2025/1/21'),
     ('24','越中国の刀工、郷義弘作の打刀。一国一城令の例外となった八代城主、松井興長が所持した。
    ','2025/1/6','2025/1/21');

回答４
mysql> SELECT name, department_id
FROM people

WHER
WHERE department_id IS NULL;
+-----------------------+---------------+
| name                  | department_id |
+-----------------------+---------------+
| 田中ゆうこ            |          NULL |
| 福田だいすけ          |          NULL |
| 豊島はなこ            |          NULL |
| 早坂てつお            |          NULL |
| 不思議沢みちこ        |          NULL |
+-----------------------+---------------+
5 rows in set (0.00 sec)

mysql>  INSERT INTO people (name, department_id)
   VALUES
   ('田中ゆうこ', 2),
   ('福田だいすけ',  1),
   ('豊島はなこ', 3),
   ('早坂てつお', 1),
   ('不思議沢みちこ',1);
Query OK, 5 rows affected (0.00 sec)
Records: 5  Duplicates: 0  Warnings: 0

mysql> SELECT * FROM people;
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                  | email                  | department_id | age  | gender | created_at          | updated_at          |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
|        27 | 田中ゆうこ            | tanaka@gizumo.jp       |          NULL |   25 |      2 | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        28 | 福田だいすけ          | fukuda@gizumo.jp       |          NULL |   42 |      1 | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        29 | 豊島はなこ            | toyoshima@gizumo.jp    |          NULL |   34 |      2 | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        30 | 早坂てつお            | hayasaka@gizumo.co.jp  |          NULL |   61 |      1 | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        31 | 不思議沢みちこ        | NULL                   |          NULL | NULL |   NULL | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        32 | 歌仙兼定              | kasen@gizumo.jp        |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        33 | 和泉守兼定            | izuminokami@gizumo.jp  |             2 |   29 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        34 | 燭台切光忠            | shokudaigiri@gizumo.jp |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        35 | へし切長谷部          | hesikiri@gizumo.co.jp  |             2 |   28 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        36 | 山姥切長義            | chogi@gizumo.co.jp     |             4 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        37 | 一文字則宗            | NULL                   |             5 | NULL |   NULL | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        38 | 山姥切国広            | kinihiro@gizumo.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        39 | 松井江                | matuigou@gizumo.jp     |             3 |   25 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        40 | 肥前忠弘              | hizen@gizumo.co.jp     |             2 |   24 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        41 | 南海太郎朝尊          | nannkai@gizumo.co.jp   |             2 |   35 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        42 | 田中ゆうこ            | NULL                   |             2 | NULL |   NULL | 2025-01-22 15:43:14 | 2025-01-22 15:43:14 |
|        43 | 福田だいすけ          | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:43:14 | 2025-01-22 15:43:14 |
|        44 | 豊島はなこ            | NULL                   |             3 | NULL |   NULL | 2025-01-22 15:43:14 | 2025-01-22 15:43:14 |
|        45 | 早坂てつお            | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:43:14 | 2025-01-22 15:43:14 |
|        46 | 不思議沢みちこ        | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:43:14 | 2025-01-22 15:43:14 |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
20 rows in set (0.00 sec)

mysql>  DELETE
  FROM people WHERE person_id in (42,43,44,45,46);
Query OK, 5 rows affected (0.00 sec)

mysql> SELECT * FROM people;
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                  | email                  | department_id | age  | gender | created_at          | updated_at          |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
|        27 | 田中ゆうこ            | tanaka@gizumo.jp       |          NULL |   25 |      2 | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        28 | 福田だいすけ          | fukuda@gizumo.jp       |          NULL |   42 |      1 | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        29 | 豊島はなこ            | toyoshima@gizumo.jp    |          NULL |   34 |      2 | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        30 | 早坂てつお            | hayasaka@gizumo.co.jp  |          NULL |   61 |      1 | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        31 | 不思議沢みちこ        | NULL                   |          NULL | NULL |   NULL | 2025-01-22 15:01:39 | 2025-01-22 15:01:39 |
|        32 | 歌仙兼定              | kasen@gizumo.jp        |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        33 | 和泉守兼定            | izuminokami@gizumo.jp  |             2 |   29 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        34 | 燭台切光忠            | shokudaigiri@gizumo.jp |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        35 | へし切長谷部          | hesikiri@gizumo.co.jp  |             2 |   28 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        36 | 山姥切長義            | chogi@gizumo.co.jp     |             4 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        37 | 一文字則宗            | NULL                   |             5 | NULL |   NULL | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        38 | 山姥切国広            | kinihiro@gizumo.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        39 | 松井江                | matuigou@gizumo.jp     |             3 |   25 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        40 | 肥前忠弘              | hizen@gizumo.co.jp     |             2 |   24 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        41 | 南海太郎朝尊          | nannkai@gizumo.co.jp   |             2 |   35 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
15 rows in set (0.00 sec)

mysql> UPDATE people
   SET department_id  = 1;
Query OK, 12 rows affected (0.00 sec)
Rows matched: 15  Changed: 12  Warnings: 0

mysql> SELECT * FROM people;
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                  | email                  | department_id | age  | gender | created_at          | updated_at          |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
|        27 | 田中ゆうこ            | tanaka@gizumo.jp       |             1 |   25 |      2 | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        28 | 福田だいすけ          | fukuda@gizumo.jp       |             1 |   42 |      1 | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        29 | 豊島はなこ            | toyoshima@gizumo.jp    |             1 |   34 |      2 | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        30 | 早坂てつお            | hayasaka@gizumo.co.jp  |             1 |   61 |      1 | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        31 | 不思議沢みちこ        | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        32 | 歌仙兼定              | kasen@gizumo.jp        |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        33 | 和泉守兼定            | izuminokami@gizumo.jp  |             1 |   29 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        34 | 燭台切光忠            | shokudaigiri@gizumo.jp |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        35 | へし切長谷部          | hesikiri@gizumo.co.jp  |             1 |   28 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        36 | 山姥切長義            | chogi@gizumo.co.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        37 | 一文字則宗            | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        38 | 山姥切国広            | kinihiro@gizumo.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        39 | 松井江                | matuigou@gizumo.jp     |             1 |   25 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        40 | 肥前忠弘              | hizen@gizumo.co.jp     |             1 |   24 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        41 | 南海太郎朝尊          | nannkai@gizumo.co.jp   |             1 |   35 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
15 rows in set (0.00 sec)

mysql> UPDATE  people
SET department_id  = 2
WHERE person_id in (33,35,40,41,28);
Query OK, 5 rows affected (0.00 sec)
Rows matched: 5  Changed: 5  Warnings: 0

mysql> SELECT * FROM people;
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                  | email                  | department_id | age  | gender | created_at          | updated_at          |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
|        27 | 田中ゆうこ            | tanaka@gizumo.jp       |             2 |   25 |      2 | 2025-01-22 15:01:39 | 2025-01-22 16:02:33 |
|        28 | 福田だいすけ          | fukuda@gizumo.jp       |             2 |   42 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:07:25 |
|        29 | 豊島はなこ            | toyoshima@gizumo.jp    |             1 |   34 |      2 | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        30 | 早坂てつお            | hayasaka@gizumo.co.jp  |             1 |   61 |      1 | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        31 | 不思議沢みちこ        | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        32 | 歌仙兼定              | kasen@gizumo.jp        |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        33 | 和泉守兼定            | izuminokami@gizumo.jp  |             2 |   29 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        34 | 燭台切光忠            | shokudaigiri@gizumo.jp |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        35 | へし切長谷部          | hesikiri@gizumo.co.jp  |             2 |   28 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        36 | 山姥切長義            | chogi@gizumo.co.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        37 | 一文字則宗            | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        38 | 山姥切国広            | kinihiro@gizumo.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        39 | 松井江                | matuigou@gizumo.jp     |             1 |   25 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        40 | 肥前忠弘              | hizen@gizumo.co.jp     |             2 |   24 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        41 | 南海太郎朝尊          | nannkai@gizumo.co.jp   |             2 |   35 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
15 rows in set (0.00 sec)

mysql> UPDATE  people
SET department_id  = 3
WHERE person_id in (39,30);
Query OK, 2 rows affected (0.00 sec)
Rows matched: 2  Changed: 2  Warnings: 0

mysql> SELECT * FROM people;
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                  | email                  | department_id | age  | gender | created_at          | updated_at          |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
|        27 | 田中ゆうこ            | tanaka@gizumo.jp       |             2 |   25 |      2 | 2025-01-22 15:01:39 | 2025-01-22 16:02:33 |
|        28 | 福田だいすけ          | fukuda@gizumo.jp       |             2 |   42 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:07:25 |
|        29 | 豊島はなこ            | toyoshima@gizumo.jp    |             1 |   34 |      2 | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        30 | 早坂てつお            | hayasaka@gizumo.co.jp  |             3 |   61 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:08:57 |
|        31 | 不思議沢みちこ        | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |
|        32 | 歌仙兼定              | kasen@gizumo.jp        |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        33 | 和泉守兼定            | izuminokami@gizumo.jp  |             2 |   29 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        34 | 燭台切光忠            | shokudaigiri@gizumo.jp |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        35 | へし切長谷部          | hesikiri@gizumo.co.jp  |             2 |   28 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        36 | 山姥切長義            | chogi@gizumo.co.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        37 | 一文字則宗            | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        38 | 山姥切国広            | kinihiro@gizumo.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        39 | 松井江                | matuigou@gizumo.jp     |             3 |   25 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:08:57 |
|        40 | 肥前忠弘              | hizen@gizumo.co.jp     |             2 |   24 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        41 | 南海太郎朝尊          | nannkai@gizumo.co.jp   |             2 |   35 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+
15 rows in set (0.00 sec)

Q5回答
mysql> SELECT * FROM people WHERE gender = 1;
+-----------+--------------------+------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name               | email                  | department_id | age  | gender | created_at          | updated_at          |
+-----------+--------------------+------------------------+---------------+------+--------+---------------------+---------------------+
|        28 | 福田だいすけ       | fukuda@gizumo.jp       |             2 |   42 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:07:25 |
|        30 | 早坂てつお         | hayasaka@gizumo.co.jp  |             3 |   61 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:08:57 |
|        32 | 歌仙兼定           | kasen@gizumo.jp        |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        33 | 和泉守兼定         | izuminokami@gizumo.jp  |             2 |   29 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        34 | 燭台切光忠         | shokudaigiri@gizumo.jp |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        35 | へし切長谷部       | hesikiri@gizumo.co.jp  |             2 |   28 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        36 | 山姥切長義         | chogi@gizumo.co.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        38 | 山姥切国広         | kinihiro@gizumo.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        39 | 松井江             | matuigou@gizumo.jp     |             3 |   25 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:08:57 |
|        40 | 肥前忠弘           | hizen@gizumo.co.jp     |             2 |   24 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        41 | 南海太郎朝尊       | nannkai@gizumo.co.jp   |             2 |   35 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
+-----------+--------------------+------------------------+---------------+------+--------+---------------------+---------------------+
11 rows in set (0.00 sec)

mysql> SELECT * FROM people WHERE gender = 1 ORDER BY age DESC;
+-----------+--------------------+------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name               | email                  | department_id | age  | gender | created_at          | updated_at          |
+-----------+--------------------+------------------------+---------------+------+--------+---------------------+---------------------+
|        30 | 早坂てつお         | hayasaka@gizumo.co.jp  |             3 |   61 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:08:57 |
|        28 | 福田だいすけ       | fukuda@gizumo.jp       |             2 |   42 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:07:25 |
|        41 | 南海太郎朝尊       | nannkai@gizumo.co.jp   |             2 |   35 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        32 | 歌仙兼定           | kasen@gizumo.jp        |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        34 | 燭台切光忠         | shokudaigiri@gizumo.jp |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        33 | 和泉守兼定         | izuminokami@gizumo.jp  |             2 |   29 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        35 | へし切長谷部       | hesikiri@gizumo.co.jp  |             2 |   28 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
|        36 | 山姥切長義         | chogi@gizumo.co.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        38 | 山姥切国広         | kinihiro@gizumo.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        39 | 松井江             | matuigou@gizumo.jp     |             3 |   25 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:08:57 |
|        40 | 肥前忠弘           | hizen@gizumo.co.jp     |             2 |   24 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |
+-----------+--------------------+------------------------+--------


Q6回答
SELECT
  `name`, `email`, `age`
テーブル上から`name`, `email`, `age`というカラムのレコードのみを表示する

FROM
  `people`
 `people`というテーブルの中から実行する

WHERE
  `department_id` = 1
テーブルの中の`department_id`というカラムの中で１と記載のあるのもという条件

ORDER BY
  `created_at`;
テーブルの中の`created_at`というカラムの中のレコードの数に沿って並び順を指定する

Q7回答
mysql> SELECT * FROM people WHERE age >= 20 AND age <= 29 AND gender = 2;  
+-----------+-----------------+------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name            | email            | department_id | age  | gender | created_at          | updated_at          |
+-----------+-----------------+------------------+---------------+------+--------+---------------------+---------------------+
|        27 | 田中ゆうこ      | tanaka@gizumo.jp |             2 |   25 |      2 | 2025-01-22 15:01:39 | 2025-01-22 16:02:33 |
+-----------+-----------------+------------------+---------------+------+--------+---------------------+---------------------+
1 row in set (0.00 sec)

mysql> SELECT * FROM people WHERE age >= 20 AND age <= 29 AND gender = 2
or age >= 40 AND age <= 49 AND gender = 1;
+-----------+--------------------+------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name               | email            | department_id | age  | gender | created_at          | updated_at          |
+-----------+--------------------+------------------+---------------+------+--------+---------------------+---------------------+
|        27 | 田中ゆうこ         | tanaka@gizumo.jp |             2 |   25 |      2 | 2025-01-22 15:01:39 | 2025-01-22 16:02:33 |
|        28 | 福田だいすけ       | fukuda@gizumo.jp |             2 |   42 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:07:25 |
+-----------+--------------------+------------------+---------------+------+--------+---------------------+---------------------+
2 rows in set (0.00 sec)

Q8回答
mysql> SELECT * FROM people WHERE  department_id = 1 AND gender = 1 ORDER BY age DESC;
+-----------+-----------------+------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name            | email                  | department_id | age  | gender | created_at          | updated_at          |
+-----------+-----------------+------------------------+---------------+------+--------+---------------------+---------------------+
|        32 | 歌仙兼定        | kasen@gizumo.jp        |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        34 | 燭台切光忠      | shokudaigiri@gizumo.jp |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
|        36 | 山姥切長義      | chogi@gizumo.co.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |
|        38 | 山姥切国広      | kinihiro@gizumo.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |
+-----------+-----------------+------------------------+---------------+------+--------+---------------------+---------------------+
4 rows in set (0.00 sec)

Q9回答
mysql> SELECT AVG(age) AS average_age FROM people GROUP BY  department_id = 2 AND gender = 2;
+-------------+
| average_age |
+-------------+
|     25.0000 |
|     32.6667 |
+-------------+
2 rows in set (0.00 sec)

Q10回答

mysql> SELECT * FROM people  INNER JOIN reports ON people.person_id  = reports.person_id;
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+-----------+-----------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------+---------------------+
| person_id | name                  | email                  | department_id | age  | gender | created_at          | updated_at          | report_id | person_id | content                                                                                                                                                                                                              | created_at          | updated_at          |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+-----------+-----------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------+---------------------+
|        35 | へし切長谷部          | hesikiri@gizumo.co.jp  |             2 |   28 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |        11 |        35 | 長谷部国重作の打刀。名の由来は、信長が膳棚の下に隠れた茶坊主をその棚ごと圧し切ったことから。
                                                                                                                        | 2025-01-20 00:00:00 | 2025-01-22 18:40:26 |
|        33 | 和泉守兼定            | izuminokami@gizumo.jp  |             2 |   29 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |        12 |        33 | 幕末から活躍した兼定の作であり、新撰組副長 土方歳三が愛用したと言われる大振りの刀
                                                                                                                                   | 2025-01-16 00:00:00 | 2025-01-22 18:42:02 |
|        32 | 歌仙兼定              | kasen@gizumo.jp        |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |        13 |        32 | 「之定」の異名を持つ、二代目兼定作の打刀。持ち主だった細川忠興が３６人の家臣を手討ちしたことから、三十六歌仙にちなんで歌仙兼定と呼ばれる。
                                                                          | 2024-12-28 00:00:00 | 2025-01-22 18:43:19 |
|        38 | 山姥切国広            | kinihiro@gizumo.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |        14 |        38 | 霊剣『山姥切』を模して造られたとされる打刀。オリジナルでないことがコンプレックス。
                                                                                                                                  | 2025-01-12 00:00:00 | 2025-01-22 18:45:53 |
|        34 | 燭台切光忠            | shokudaigiri@gizumo.jp |             1 |   31 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:01:55 |        15 |        34 | 備前長船派の事実上の祖といわれている刀工、光忠の作。名は、伊達政宗がこの太刀で家臣を斬った際にその勢いで燭台まで斬れたという話が由来。
                                                                              | 2025-01-16 00:00:00 | 2025-01-22 18:46:45 |
|        40 | 肥前忠弘              | hizen@gizumo.co.jp     |             2 |   24 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |        16 |        40 | 岡田以蔵が使用していたとされる脇差。                                                                                                                                                                                 | 2025-01-12 00:00:00 | 2025-01-22 18:47:27 |
|        41 | 南海太郎朝尊          | nannkai@gizumo.co.jp   |             2 |   35 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:07:25 |        17 |        41 | 武市半平太が使用していたとされる打刀。学者然とした刀剣男士であり、知識で審神者を助ける。
                                                                                                                            | 2025-01-10 00:00:00 | 2025-01-22 18:47:55 |
|        36 | 山姥切長義            | chogi@gizumo.co.jp     |             1 |   26 |      1 | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |        18 |        36 | 備前長船長義作の打刀。長義は長船派の主流とは別系統の刀工となる。写しであると言われている山姥切国広と共に伯仲の出来。
                                                                                                | 2025-01-06 00:00:00 | 2025-01-22 18:48:18 |
|        37 | 一文字則宗            | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:01:55 | 2025-01-22 15:59:26 |        19 |        37 | 福岡一文字派の作とされている太刀。則宗は福岡一文字派の始祖であり、後鳥羽院番鍛冶の一人として名高い。
                                                                                                                | 2025-01-21 00:00:00 | 2025-01-22 18:48:45 |
|        39 | 松井江                | matuigou@gizumo.jp     |             3 |   25 |      1 | 2025-01-22 15:01:55 | 2025-01-22 16:08:57 |        20 |        39 | 越中国の刀工、郷義弘作の打刀。一国一城令の例外となった八代城主、松井興長が所持した。
                                                                                                                                | 2025-01-06 00:00:00 | 2025-01-22 18:49:15 |
|        27 | 田中ゆうこ            | tanaka@gizumo.jp       |             2 |   25 |      2 | 2025-01-22 15:01:39 | 2025-01-22 16:02:33 |        21 |        27 | 明日のタスクと本日の進捗状況                                                                                                                                                                                         | 2025-01-16 00:00:00 | 2025-01-21 00:00:00 |
|        30 | 早坂てつお            | hayasaka@gizumo.co.jp  |             3 |   61 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:08:57 |        22 |        30 | 今後のチームの課題について                                                                                                                                                                                           | 2024-12-28 00:00:00 | 2025-01-06 00:00:00 |
|        28 | 福田だいすけ          | fukuda@gizumo.jp       |             2 |   42 |      1 | 2025-01-22 15:01:39 | 2025-01-22 16:07:25 |        23 |        28 | 研修を受けて自身が感じたこと                                                                                                                                                                                         | 2025-01-12 00:00:00 | 2025-01-16 00:00:00 |
|        31 | 不思議沢みちこ        | NULL                   |             1 | NULL |   NULL | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |        24 |        31 | 明日のタスクと本日の進捗状況                                                                                                                                                                                         | 2025-01-16 00:00:00 | 2025-01-21 00:00:00 |
|        29 | 豊島はなこ            | toyoshima@gizumo.jp    |             1 |   34 |      2 | 2025-01-22 15:01:39 | 2025-01-22 15:59:26 |        25 |        29 | 本日の課題と進捗状況について                                                                                                                                                                                         | 2025-01-12 00:00:00 | 2025-01-18 00:00:00 |
+-----------+-----------------------+------------------------+---------------+------+--------+---------------------+---------------------+-----------+-----------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------+---------------------+
15 rows in set (0.00 sec)

mysql>  SELECT name, department_id , content FROM people  INNER JOIN reports ON people.person_id  = reports.person_id;
+-----------------------+---------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| name                  | department_id | content                                                                                                                                                                                                              |
+-----------------------+---------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| へし切長谷部          |             2 | 長谷部国重作の打刀。名の由来は、信長が膳棚の下に隠れた茶坊主をその棚ごと圧し切ったことから。
                                                                                                                        |
| 和泉守兼定            |             2 | 幕末から活躍した兼定の作であり、新撰組副長 土方歳三が愛用したと言われる大振りの刀
                                                                                                                                   |
| 歌仙兼定              |             1 | 「之定」の異名を持つ、二代目兼定作の打刀。持ち主だった細川忠興が３６人の家臣を手討ちしたことから、三十六歌仙にちなんで歌仙兼定と呼ばれる。
                                                                          |
| 山姥切国広            |             1 | 霊剣『山姥切』を模して造られたとされる打刀。オリジナルでないことがコンプレックス。
                                                                                                                                  |
| 燭台切光忠            |             1 | 備前長船派の事実上の祖といわれている刀工、光忠の作。名は、伊達政宗がこの太刀で家臣を斬った際にその勢いで燭台まで斬れたという話が由来。
                                                                              |
| 肥前忠弘              |             2 | 岡田以蔵が使用していたとされる脇差。                                                                                                                                                                                 |
| 南海太郎朝尊          |             2 | 武市半平太が使用していたとされる打刀。学者然とした刀剣男士であり、知識で審神者を助ける。
                                                                                                                            |
| 山姥切長義            |             1 | 備前長船長義作の打刀。長義は長船派の主流とは別系統の刀工となる。写しであると言われている山姥切国広と共に伯仲の出来。
                                                                                                |
| 一文字則宗            |             1 | 福岡一文字派の作とされている太刀。則宗は福岡一文字派の始祖であり、後鳥羽院番鍛冶の一人として名高い。
                                                                                                                |
| 松井江                |             3 | 越中国の刀工、郷義弘作の打刀。一国一城令の例外となった八代城主、松井興長が所持した。
                                                                                                                                |
| 田中ゆうこ            |             2 | 明日のタスクと本日の進捗状況                                                                                                                                                                                         |
| 早坂てつお            |             3 | 今後のチームの課題について                                                                                                                                                                                           |
| 福田だいすけ          |             2 | 研修を受けて自身が感じたこと                                                                                                                                                                                         |
| 不思議沢みちこ        |             1 | 明日のタスクと本日の進捗状況                                                                                                                                                                                         |
| 豊島はなこ            |             1 | 本日の課題と進捗状況について                                                                                                                                                                                         |
+-----------------------+---------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
15 rows in set (0.00 sec)

Q11回答

mysql>  SELECT * FROM people left outer JOIN reports ON people.person_id  = reports.person_id  WHERE content  IS NULL;
+-----------+--------------------+----------------------------+---------------+------+--------+---------------------+---------------------+-----------+-----------+---------+------------+------------+
| person_id | name               | email                      | department_id | age  | gender | created_at          | updated_at          | report_id | person_id | content | created_at | updated_at |
+-----------+--------------------+----------------------------+---------------+------+--------+---------------------+---------------------+-----------+-----------+---------+------------+------------+
|        47 | にっかり青江       | aoe@gizumo.jp              |             1 |   30 |      1 | 2025-01-23 10:41:02 | 2025-01-23 10:41:02 |      NULL |      NULL | NULL    | NULL       | NULL       |
|        48 | 三日月宗近         | mikazukimunetika@gizumo.jp |             2 |   34 |      1 | 2025-01-23 10:41:02 | 2025-01-23 10:41:02 |      NULL |      NULL | NULL    | NULL       | NULL       |
+-----------+--------------------+----------------------------+---------------+------+--------+---------------------+---------------------+-----------+-----------+---------+------------+------------+
2 rows in set (0.00 sec)

できたーーーーーーーーー！！！！！！！
推しゲームのキャラクター名で作りました。



